>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. InCollege.

DATA DIVISION.
WORKING-STORAGE SECTION.

77 WS-APP-SHOULD-QUIT PIC X VALUE "N".
77 WS-MAIN-MENU-INPUT PIC X VALUE SPACE.
77 WS-MAIN-MENU-LENGTH PIC 9(4) VALUE 1.
77 WS-TOTAL-SAVED-ACCTS PIC 9 VALUE 0.
77 WS-LOGIN-WORKED PIC X VALUE "N".
77 WS-LOG-TEXT PIC X(300) VALUE SPACES.
77 WS-CLOSE-LENGTH PIC 9(4) VALUE 0.
01 WS-CREDENTIALS-LIST.
05 WS-CREDS-ROW OCCURS 5 TIMES.
10 WS-STORED-USERNAME PIC X(30).
10 WS-STORED-PASSWORD PIC X(12).
PROCEDURE DIVISION.

MAIN-FLOW.
        CALL "TestOutput" USING "I" WS-LOG-TEXT
    CALL "DataStore" USING "L" WS-TOTAL-SAVED-ACCTS WS-CREDENTIALS-LIST
    PERFORM UNTIL WS-APP-SHOULD-QUIT = "Y"
        PERFORM SHOW-MAIN-MENU
    CALL "TestInput" USING WS-MAIN-MENU-LENGTH WS-MAIN-MENU-INPUT
        DISPLAY FUNCTION TRIM(WS-MAIN-MENU-INPUT)
                MOVE SPACES TO WS-LOG-TEXT
                STRING FUNCTION TRIM(WS-MAIN-MENU-INPUT) DELIMITED BY SIZE
                    INTO WS-LOG-TEXT
                END-STRING
                CALL "TestOutput" USING "A" WS-LOG-TEXT
        IF FUNCTION TRIM(WS-MAIN-MENU-INPUT) = ""
            MOVE "Y" TO WS-APP-SHOULD-QUIT
            EXIT PERFORM
        END-IF
        EVALUATE WS-MAIN-MENU-INPUT
            WHEN "1"
                CALL "LogIn" USING WS-TOTAL-SAVED-ACCTS WS-CREDENTIALS-LIST WS-LOGIN-WORKED
            WHEN "2"
                CALL "CreateAccount" USING WS-TOTAL-SAVED-ACCTS WS-CREDENTIALS-LIST
                CALL "DataStore" USING "S" WS-TOTAL-SAVED-ACCTS WS-CREDENTIALS-LIST
            WHEN "3"
                MOVE "Y" TO WS-APP-SHOULD-QUIT
            WHEN OTHER
                DISPLAY "Invalid option. Try again."
                MOVE "Invalid option. Try again." TO WS-LOG-TEXT
                CALL "TestOutput" USING "A" WS-LOG-TEXT
        END-EVALUATE
    END-PERFORM
    CALL "TestInput" USING WS-CLOSE-LENGTH WS-LOG-TEXT
    STOP RUN.

SHOW-MAIN-MENU.
    DISPLAY "Welcome to InCollege!"
    MOVE "Welcome to InCollege!" TO WS-LOG-TEXT
    CALL "TestOutput" USING "A" WS-LOG-TEXT
    DISPLAY "1) Log In"
    MOVE "1) Log In" TO WS-LOG-TEXT
    CALL "TestOutput" USING "A" WS-LOG-TEXT
    DISPLAY "2) Create Account"
    MOVE "2) Create Account" TO WS-LOG-TEXT
    CALL "TestOutput" USING "A" WS-LOG-TEXT
    DISPLAY "3) Exit"
    MOVE "3) Exit" TO WS-LOG-TEXT
    CALL "TestOutput" USING "A" WS-LOG-TEXT
    DISPLAY "Choose an option: ".
    MOVE "Choose an option: " TO WS-LOG-TEXT
    CALL "TestOutput" USING "A" WS-LOG-TEXT.