>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. InCollege.

DATA DIVISION.
WORKING-STORAGE SECTION.

77 WS-APP-SHOULD-QUIT PIC X VALUE "N".
77 WS-MAIN-MENU-INPUT PIC X VALUE SPACE.
77 WS-TOTAL-SAVED-ACCTS PIC 9 VALUE 0.
77 WS-LOGIN-WORKED PIC X VALUE "N".
01 WS-CREDENTIALS-LIST.
05 WS-CREDS-ROW OCCURS 5 TIMES.
10 WS-STORED-USERNAME PIC X(30).
10 WS-STORED-PASSWORD PIC X(12).
PROCEDURE DIVISION.

MAIN-FLOW.
    CALL "DataStore" USING "L" WS-TOTAL-SAVED-ACCTS WS-CREDENTIALS-LIST
    PERFORM UNTIL WS-APP-SHOULD-QUIT = "Y"
        PERFORM SHOW-MAIN-MENU
        ACCEPT WS-MAIN-MENU-INPUT
        DISPLAY WS-MAIN-MENU-INPUT
        IF FUNCTION TRIM(WS-MAIN-MENU-INPUT) = ""
            MOVE "Y" TO WS-APP-SHOULD-QUIT
            EXIT PERFORM
        END-IF
        EVALUATE WS-MAIN-MENU-INPUT
            WHEN "1"
                CALL "LogIn" USING WS-TOTAL-SAVED-ACCTS WS-CREDENTIALS-LIST WS-LOGIN-WORKED
            WHEN "2"
                CALL "CreateAccount" USING WS-TOTAL-SAVED-ACCTS WS-CREDENTIALS-LIST
                CALL "DataStore" USING "S" WS-TOTAL-SAVED-ACCTS WS-CREDENTIALS-LIST
            WHEN "3"
                MOVE "Y" TO WS-APP-SHOULD-QUIT
            WHEN OTHER
                DISPLAY "Invalid option. Try again."
        END-EVALUATE
    END-PERFORM
    STOP RUN.

SHOW-MAIN-MENU.
    DISPLAY "Welcome to InCollege!"
    DISPLAY "1) Log In"
    DISPLAY "2) Create Account"
    DISPLAY "3) Exit"
    DISPLAY "Choose an option: ".