       IDENTIFICATION DIVISION.
       PROGRAM-ID. InCollege.

       PROCEDURE DIVISION.
           DISPLAY "InCollege Epic 1 starter program".
           STOP RUN.
