>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. ProfileEdit.

DATA DIVISION.
WORKING-STORAGE SECTION.
77 IDX PIC 9(2) VALUE 1.
77 FOUND-FLAG PIC X VALUE "N".

LINKAGE SECTION.
01 PROFILE-RECORD.
   05 LK-PROF-ROW OCCURS 10 TIMES.
      10 Username PIC X(10).
      10 Name PIC X(25).
      10 University PIC X(25).
      10 Major PIC X(25).
      10 GradYear PIC X(4).
      10 About PIC X(200).
      10 JobTitle PIC X(25).
      10 Company PIC X(25).
      10 Dates PIC X(15).
      10 Desc PIC X(100).
      10 Degree PIC X(25).
      10 Univ PIC X(25).
      10 Years PIC X(15).
01 LK-PROFILE-COUNT PIC 9(2).
01 LK-USERNAME PIC X(10).

PROCEDURE DIVISION USING PROFILE-RECORD LK-PROFILE-COUNT LK-USERNAME.
MAIN.
    DISPLAY "Under construction"
    GOBACK.