>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. ProfileEdit.

DATA DIVISION.

LINKAGE SECTION.
01 LNK-USER-NAME PIC X(20).

PROCEDURE DIVISION USING LNK-USER-NAME.

MAIN.
    CALL "PersonalProfile" USING LNK-USER-NAME
    CALL "ProfileCreate" USING LNK-USER-NAME
    DISPLAY "Profile updated successfully."
    GOBACK.

END PROGRAM ProfileEdit.