>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. Search.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
       SELECT PROFILE-FILE ASSIGN TO "data/profiles.dat"
           ORGANIZATION IS LINE SEQUENTIAL.
       SELECT INPUT-FILE ASSIGN TO "data/InCollege-Input.txt"
           ORGANIZATION IS LINE SEQUENTIAL.
       SELECT OUTPUT-FILE ASSIGN TO "data/InCollege-Output.txt"
           ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD     PROFILE-FILE.
01 PROFILE-RECORD.
       05 PR-USERNAME      PIC X(30).
       05 PR-NAME          PIC X(50).
       05 PR-UNIVERSITY    PIC X(50).
       05 PR-MAJOR         PIC X(50).
       05 PR-GRADYEAR      PIC 9(4).
       05 PR-ABOUT         PIC X(200).
       05 PR-JOBTITLE      PIC X(50) OCCURS 3 TIMES.
       05 PR-COMPANY       PIC X(50) OCCURS 3 TIMES.
       05 PR-DATES         PIC X(30) OCCURS 3 TIMES.
       05 PR-DESC          PIC X(200) OCCURS 3 TIMES.
       05 PR-DEGREE        PIC X(50) OCCURS 3 TIMES.
       05 PR-UNIV          PIC X(50) OCCURS 3 TIMES.
       05 PR-YEARS         PIC X(30) OCCURS 3 TIMES.
FD  INPUT-FILE.
01  IN-RECORD              PIC X(80).

FD  OUTPUT-FILE.
01  OUT-RECORD             PIC X(255).

WORKING-STORAGE SECTION.
01     WS-SEARCH-QUERY     PIC X(50).
01     WS-EOF-PROFILE              PIC X VALUE 'N'.
01     WS-FOUND-FLAG       PIC X VALUE 'N'.
01     I                   PIC 9 VALUE 1.

PROCEDURE DIVISION.
MAIN-LOGIC.
       OPEN INPUT PROFILE-FILE
       OPEN EXTEND OUTPUT-FILE
       DISPLAY "Enter the full name of the person you are looking for:"
       ACCEPT WS-SEARCH-QUERY

       INSPECT WS-SEARCH-QUERY REPLACING ALL X'0D' BY SPACE
       INSPECT WS-SEARCH-QUERY REPLACING ALL X'0A' BY SPACE


       *>MOVE "Enter the full name of the person you are looking for:"
           *>TO OUT-RECORD
       *>PERFORM DISPLAY-AND-WRITE

       MOVE 'N' TO WS-EOF-PROFILE
       MOVE 'N' TO WS-FOUND-FLAG

       PERFORM UNTIL WS-EOF-PROFILE = 'Y' OR WS-FOUND-FLAG = 'Y'
           READ PROFILE-FILE
               AT END
                   MOVE 'Y' TO WS-EOF-PROFILE
               NOT AT END
                   IF FUNCTION TRIM(PR-NAME) = FUNCTION TRIM(WS-SEARCH-QUERY)
                       MOVE 'Y' TO WS-FOUND-FLAG
                       PERFORM DISPLAY-PROFILE
                   END-IF
           END-READ
       END-PERFORM

       IF WS-FOUND-FLAG = 'N'
           MOVE "No one by that name could be found." TO OUT-RECORD
           PERFORM DISPLAY-AND-WRITE
       END-IF

       CLOSE PROFILE-FILE
       CLOSE OUTPUT-FILE

       EXIT PROGRAM.

DISPLAY-PROFILE.
       MOVE " " TO OUT-RECORD.
       PERFORM DISPLAY-AND-WRITE.
       MOVE "--- Found User Profile ---" TO OUT-RECORD.
       PERFORM DISPLAY-AND-WRITE.
       
       STRING "Name: " FUNCTION TRIM(PR-NAME) INTO OUT-RECORD.
       PERFORM DISPLAY-AND-WRITE.
       
       STRING "University: " FUNCTION TRIM(PR-UNIVERSITY) INTO OUT-RECORD.
       PERFORM DISPLAY-AND-WRITE.
       
       STRING "Major: " FUNCTION TRIM(PR-MAJOR) INTO OUT-RECORD.
       PERFORM DISPLAY-AND-WRITE.
       
       STRING "Graduation Year: " PR-GRADYEAR INTO OUT-RECORD.
       PERFORM DISPLAY-AND-WRITE.
       
       STRING "About Me: " FUNCTION TRIM(PR-ABOUT) INTO OUT-RECORD.
       PERFORM DISPLAY-AND-WRITE.

       MOVE "Experience: " TO OUT-RECORD.
       PERFORM DISPLAY-AND-WRITE.
       PERFORM VARYING I FROM 1 BY 1 UNTIL I > 3
           IF PR-JOBTITLE(I) NOT = SPACES AND NOT = "None"
               STRING "  Title: " FUNCTION TRIM(PR-JOBTITLE(I)) INTO OUT-RECORD
               PERFORM DISPLAY-AND-WRITE
               STRING "  Company: " FUNCTION TRIM(PR-COMPANY(I)) INTO OUT-RECORD
               PERFORM DISPLAY-AND-WRITE
               STRING "  Dates: " FUNCTION TRIM(PR-DATES(I)) INTO OUT-RECORD
               PERFORM DISPLAY-AND-WRITE
               STRING "  Description: " FUNCTION TRIM(PR-DESC(I)) INTO OUT-RECORD
               PERFORM DISPLAY-AND-WRITE
           END-IF
       END-PERFORM.

       MOVE "Education: " TO OUT-RECORD.
       PERFORM DISPLAY-AND-WRITE.
       PERFORM VARYING I FROM 1 BY 1 UNTIL I > 3
           IF PR-DEGREE(I) NOT = SPACES AND NOT = "None"
               STRING "  Degree: " FUNCTION TRIM(PR-DEGREE(I)) INTO OUT-RECORD
               PERFORM DISPLAY-AND-WRITE
               STRING "  University: " FUNCTION TRIM(PR-UNIV(I)) INTO OUT-RECORD
               PERFORM DISPLAY-AND-WRITE
               STRING "  Years: " FUNCTION TRIM(PR-YEARS(I)) INTO OUT-RECORD
               PERFORM DISPLAY-AND-WRITE
           END-IF
       END-PERFORM.
       
       MOVE "-------------------------" TO OUT-RECORD.
       PERFORM DISPLAY-AND-WRITE.
       MOVE " " TO OUT-RECORD.
       PERFORM DISPLAY-AND-WRITE.

DISPLAY-AND-WRITE.
       DISPLAY FUNCTION TRIM(OUT-RECORD)
       MOVE SPACES TO OUT-RECORD.